FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ХоббиИОтдых.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ХоббиИОтдых</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionХоббиИОтдых</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoodsType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_GoodsType_ХоббиИОтдых</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VehicleType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_VehicleType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_ХоббиИОтдых/Ext/Module.bsl
Функция ЗаполнитьСправочникGoodsType() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементыGoodsType("Билеты и путешествия", ПолучитьGoodsType_БилетыИПутешествия());
		НайтиИДобавитьЭлементыGoodsType("Книги и журналы", ПолучитьGoodsType_КнигиИЖурналы());
		НайтиИДобавитьЭлементыGoodsType("Коллекционирование", ПолучитьGoodsType_Коллекционирование());
		НайтиИДобавитьЭлементыGoodsType("Музыкальные инструменты", ПолучитьGoodsType_МузыкальныеИнструменты());
		НайтиИДобавитьЭлементыGoodsType("Спорт и отдых", ПолучитьGoodsType_СпортИОтдых());
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Процедура НайтиИДобавитьЭлементыGoodsType(ИмяВладелеца, СписокGoodsType)
	Категория = Справочники.ns_Category.НайтиПоНаименованию(ИмяВладелеца);
    Если Категория.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Элемент Из СписокGoodsType Цикл
		НайтиИДобавитьЭлементGoodsType(Элемент, Категория);
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИДобавитьЭлементGoodsType(Наименование, Владелец)
	Элемент = Справочники.ns_GoodsType_ХоббиИОтдых.НайтиПоНаименованию(Наименование,,, Владелец);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Справочники.ns_GoodsType_ХоббиИОтдых.СоздатьЭлемент();
		Элемент.Владелец = Владелец; 
		Элемент.Наименование = Наименование;
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьGoodsType_БилетыИПутешествия()
	Список = Новый Массив;
	Список.Добавить("Карты, купоны");
	Список.Добавить("Концерты");
	Список.Добавить("Путешествия");
	Список.Добавить("Спорт");
	Список.Добавить("Театр, опера, балет");
	Список.Добавить("Цирк, кино");
	Список.Добавить("Шоу, мюзикл");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_КнигиИЖурналы()
	Список = Новый Массив;
	Список.Добавить("Журналы, газеты, брошюры");
	Список.Добавить("Книги");
	Список.Добавить("Учебная литература");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_Коллекционирование()
	Список = Новый Массив;
	Список.Добавить("Банкноты");
	Список.Добавить("Билеты");
	Список.Добавить("Вещи знаменитостей, автографы");
	Список.Добавить("Военные вещи");
	Список.Добавить("Грампластинки");
	Список.Добавить("Документы");
	Список.Добавить("Жетоны, медали, значки");
	Список.Добавить("Игры");
	Список.Добавить("Календари");
	Список.Добавить("Картины");
	Список.Добавить("Киндер-сюрприз");
	Список.Добавить("Конверты и почтовые карточки");
	Список.Добавить("Макеты оружия");
	Список.Добавить("Марки");
	Список.Добавить("Модели");
	Список.Добавить("Монеты");
	Список.Добавить("Открытки");
	Список.Добавить("Пепельницы, зажигалки");
	Список.Добавить("Пластиковые карточки");
	Список.Добавить("Спортивные карточки");
	Список.Добавить("Фотографии, письма");
	Список.Добавить("Этикетки, бутылки, пробки");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_МузыкальныеИнструменты()
	Список = Новый Массив;
	Список.Добавить("Аккордеоны, гармони, баяны");
	Список.Добавить("Гитары и другие струнные");
	Список.Добавить("Духовые");
	Список.Добавить("Пианино и другие клавишные");
	Список.Добавить("Скрипки и другие смычковые");
	Список.Добавить("Ударные");
	Список.Добавить("Для студии и концертов");
	Список.Добавить("Аксессуары");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_СпортИОтдых()
	Список = Новый Массив;
	Список.Добавить("Бильярд и боулинг");
	Список.Добавить("Дайвинг и водный спорт");
	Список.Добавить("Единоборства");
	Список.Добавить("Зимние виды спорта");
	Список.Добавить("Игры с мячом");
	Список.Добавить("Настольные игры");
	Список.Добавить("Пейнтбол и страйкбол");
	Список.Добавить("Ролики и скейтбординг");
	Список.Добавить("Теннис, бадминтон, пинг-понг");
	Список.Добавить("Туризм");
	Список.Добавить("Фитнес и тренажёры");
	Список.Добавить("Спортивное питание");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция СправочникХоббиИОтдыхСопоставлен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_ХоббиИОтдых.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ХоббиИОтдых КАК ns_ХоббиИОтдых";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции

// Область Выгрузка

Функция ПолучитьДанныеНоменклатуры(МагазинСтрока) Экспорт 
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьIDКатегории() Тогда
		Префикс = "hob-" + Строка(МагазинСтрока.Магазин.Префикс) + "-";
	Иначе
		Префикс = Строка(МагазинСтрока.Магазин.Префикс);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ХоббиИОтдых.Номенклатура КАК Номенклатура,
	|	ns_ХоббиИОтдых.Title КАК Title,
	|	ns_ХоббиИОтдых.AdStatus КАК AdStatus,
	|	ns_ХоббиИОтдых.AllowEmail КАК AllowEmail,
	|	ns_ХоббиИОтдых.AvitoId КАК AvitoId,
	|	ns_ХоббиИОтдых.Category КАК Category,
	|	ns_ХоббиИОтдых.GoodsType КАК GoodsType,
	|	ns_ХоббиИОтдых.DateBegin КАК DateBegin,
	|	ns_ХоббиИОтдых.DateEnd КАК DateEnd,
	|	&Префикс + ns_ХоббиИОтдых.Id КАК Id,
	|	ns_ХоббиИОтдых.ListingFee КАК ListingFee,
	|	ns_ХоббиИОтдых.nsDescription КАК nsDescription,
	|	ns_ХоббиИОтдых.VideoURL КАК VideoURL,
	|	ns_ХоббиИОтдых.Шаблон КАК Шаблон,
	|	0 КАК Price,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(17)) КАК ContactPhone,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК ManagerName,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Address,
	|	ns_ХоббиИОтдых.Артикул КАК Артикул,
	|	ns_ХоббиИОтдых.Наименование КАК Наименование,
	|	ns_ХоббиИОтдых.Характеристика КАК Характеристика,
	|	ns_ХоббиИОтдых.Ссылка КАК Ссылка,
	|	ns_ХоббиИОтдых.Condition КАК Condition,
	|	ns_ХоббиИОтдых.AdType КАК AdType,
	|	ns_ХоббиИОтдых.VehicleType КАК VehicleType
	|ИЗ
	|	Справочник.ns_ХоббиИОтдых КАК ns_ХоббиИОтдых
	|ГДЕ
	|	ns_ХоббиИОтдых.ЭтоГруппа = ЛОЖЬ
	|	И ns_ХоббиИОтдых.Выгружать = ИСТИНА";
	Запрос.УстановитьПараметр("Префикс", Префикс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

// Область Выгрузка

//Область Сопоставление

Процедура Сопоставить(Ссылка, Характеристика, Родитель, ТаблицаСопоставления) Экспорт
	Изменен = Истина;
	
	СсылкаНаЭлемент = ns_Сопоставление.НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления);
	Если СсылкаНаЭлемент = Неопределено Тогда
		ОбъектЭлемент = Справочники.ns_ХоббиИОтдых.СоздатьЭлемент();
		ОбъектЭлемент.Номенклатура = Ссылка;
		Если ЗначениеЗаполнено(Характеристика) Тогда
			ОбъектЭлемент.Характеристика = Характеристика;
			Id = Строка(Ссылка.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		Иначе
			Id = Строка(Ссылка.УникальныйИдентификатор());
		КонецЕсли; 
		ОбъектЭлемент.Id = Id;
		ОбъектЭлемент.Выгружать = ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьВВыгрузку();
		ОбъектЭлемент.Condition = ns_ОбщегоНазначенияПовтИсп.ПолучитьConditionХоббиИОтдых();
		ОбъектЭлемент.AdType = ns_ОбщегоНазначенияПовтИсп.ПолучитьAdType();
		
		Изменен = Истина;
	Иначе
		ОбъектЭлемент = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли; 
	
	ns_Сопоставление.ЗаполнитьTitle(ОбъектЭлемент);
	ns_Сопоставление.ЗаполнитьDescription(Ссылка, ОбъектЭлемент);
	
	ОбъектЭлемент.ПометкаУдаления = Ссылка.ПометкаУдаления;
	ОбъектЭлемент.Наименование = Ссылка.Наименование;
	ОбъектЭлемент.Артикул = Ссылка.Артикул;
	ОбъектЭлемент.Родитель = Справочники.ns_ХоббиИОтдых.ПолучитьСсылку(Родитель.УникальныйИдентификатор());
	
	Если Изменен Тогда
		ОбъектЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьЭлементНоменклатуры(Ссылка) Экспорт
	ns_Сопоставление.СопоставитьЭлементНоменклатуры(Ссылка, "ns_ХоббиИОтдых");			
КонецПроцедуры
 
//КонецОбласти
